Repository: jdvelasq/decision-analysis
Catalog: sphinx/locale/*/LC_MESSAGES/datanodes.po
Languages: es

source: Node types
es: Tipos de Nodos

source: This module is used to create and characterize the nodes of the tree. The package implements three types of nodes:
es: Este módulo es usado para crear y caracterizar los nodos del arbol.El paquete implementa tres tipos de nodos:

source: Terminal nodes.
es: Nodos terminales.

source: Decision nodes.
es: Nodos de decisión.

source: Chance nodes.
es: Nodos aleatorios.

source: This is a bag used to create and contain the different types of the tree nodes. The functions `terminal`, `chance`, and `decision` are used to create the nodes.
es: Esta es una estructura para crear y almacenar los tipos de nodos del arbol. Las funciones `terminal`, `chance` y `decision` son usadas para crear los nodos.

source: Adds a chance node to the bag.
es: Adicioina un nodo aleatorio a la bolsa.

source: Parameters
es: Parámetros

source: Name assigned to the node.
es: Nombre asignado al nodo.

source: A list of tuples, where each tuple contains the following information: * Name of the branch. * Probability. * Associated value to the branch. * Name of the successor node.
es: Una lista de tuplas, donde cada tupla contiene la siguiente información: nombre de la rama; probabilidad; valor asociado a la rama; nombre del nodo sucesor.

source: A list of tuples, where each tuple contains the following information:
es: Una lista de tuplas, donde cada tupla contiene la siguiente información:

source: Name of the branch.
es: Nombre de la rama.

source: Probability.
es: Probabilidad.

source: Associated value to the branch.
es: Valor asociado a la rama.

source: Name of the successor node.
es: Nombre del nodo sucesor.

source: Return type
es: Tipo retornado

source: Adds a decision node to the bag.
es: Adiciona un nodo de decisión a la bolsa.

source: A list of tuples, where each tuple contains the following information: * Name of the branch. * Associated value to the branch. * Name of the successor node.
es: Una lista de tuplas, donde cada tupla contiene la siguiente información: Nombre de la rama; valor asociado a la rama; nombre del nodo sucesor.

source: When it is `True`, selects the branch with the maximum expected value.
es: Cuando es `True` selecciona la rama con el valor esperado máximo.

source: It is a valid python function used for computing the value of the terminal node in the tree. The names of the created nodes must be used as the parameters of the function.
es: Es una función valida de Pyhon usada para calcular el valor del nodo terminal en el árbol. Los nombres nombres de los nodos creados deben ser usados comolos parámetros de la función.

source: Creates a deep copy of the bag. This function is used internally by the package.
es: Crea una copia profunda de la bolsa. Esta función es usada internamente por el paquete.

source: Gets the position of the branches with top and bottom values.
es: Obtiene la posición de las ramas con los valores superior e inferior.

source: Creates a dependent outcome for a branch.
es: Crea un resultado dependiente para la rama.

source: value assigned to the branch.
es: Valor asignado a la rama.

source: pairs of variables and values specifying the required conditions to assign the outcome to a branch.
es: Pares de variables y valores especificando las condiciones requeridas para asignar el valor a la rama.

source: Creates a dependent probability for a branch.
es: Crea una probabilidad dependiente para la rama.

source: probability assigned to the branch.
es: Probabilidad asignada a la rama.

source: pairs of variables and values specifying the required conditions to assign the probability to a branch.
es: Pares de variables y valores especificando las condiciones requeridas para asignar la probabilidad a una rama.

source: Set to zero the probabilities of the all branchs of variable.
es: Fija en cero las probabilidades de todas las ramas de una variable.
