Repository: jdvelasq/decision-analysis
Catalog: sphinx/locale/*/LC_MESSAGES/decisiontree.po
Languages: es

source: Decision Tree Model
es: Modelo del Arbol de Decisión

source: The **DecisionTree** is the object used to represent the decision tree model. This module is responsible for all functionality of the package. A typical sequence of use is the following:
es: `DecisionTree` es el objeto usado para representar el modelo del árbol de decision. Este módulo es responsable de toda la funcionalidad del paquete. Una secuencia típida de uso es la siguiente:

source: Create the nodes used to feed the tree (Module `nodes`).
es: Cree los nodos que conforman el árbol (Módulo `nodes`).

source: Create the tree.
es: Cree el árbol.

source: Build the internal structure of the tree.
es: Construya la estructura interna del árbol.

source: Evaluate the tree.
es: Evalue el árbol.

source: Analyze plots and other results.
es: Analice las gráficas y demás resultados.

source: Modify the structure of the tree and repeat the analysis.
es: Modifique la estructura del árbol y repita los análisis.

source: Decision tree representation.
es: Representación del árbol de decisión.

source: Parameters
es: Parámetros

source: Types of nodes used in the tree. This parameter is created using the module `Nodes`.
es: Tipos de nodos usados en el árbol. Este parámetro es creado usando el modulo `Nodes`.

source: Return type
es: Tipo retornado

source: Creates a copy of the decision tree.
es: Crea una copia del árbol de decisión.

source: Prints the tree as text diagram.
es: Imprime el árbol como un diagrama de texto.

source: Id number of the root of the tree to be exported. When it is zero, the entire tree is exported.
es: Número de identificación de la raiz del árbol a ser exportado. Cuando es `0`, el árbol completo es exportdo.

source: Controls the maximum deep of the nodes in the tree exported as text.
es: Controla la máxima profundidad de los nodos en el árbol exportado como texto.

source: When `True` exports only the subtree showing the nodes and branches relevants to the optimal decision (optimal strategy).
es: Cuando es `True` exporta únicamente el subárbol mostrando los nodos y ramas relevantes a la decisión óptima (estrategia óptima).

source: Presented values in the tree: `"ev"` is the expected value; `"eu"` is the expected utility. `"ce"` is the certain equivalent.
es: Valores presentados en el árbol: `"ev" es el valor esperado; `"eu"` es la utilidad esperada; `"ce"` es el equivalente a certeza.

source: Calculates the values at the end of the tree (terminal nodes).
es: Cálcula los valores en los nodos terminales del árbol.

source: Prints the internal structure of the tree as a list of nodes.
es: Imprime la estructura internal del árbol como una lista de nodos.

source: Plots the tree.
es: Grafica el árbol.

source: maximum deep of the tree nodes to be plotted.
es: Máxima profunidad de los nodos del árbol a ser graficado.

source: When `True`, it plots only the subtree showing the nodes and branches relevants to the optimal decision (optimal strategy).
es: Cuando es `True`, grafica únicamente el subárbol mostrando los nodos y ramas relevantes a la decisión óptima (estrategia óptima)

source: Build the tree using the structure information in the data nodes.
es: Construye el árbol usando la información de la estructura en los datos de los nodos.

source: Computes the preferred decision by calculating the expected values at each internal node, and returns the expected value of the preferred decision.
es: Computa la decisión óptimca, calculando los valores esperados en cada nodo interno, yretorna el valor esperado de la decisión óptima.

source: Computation begins at the terminal nodes towards the root node. In each chance node, the expected values are calculated as the sum of probabilities in each branch multiplied by the expected value in the corresponding node. For decision nodes, the expected value is the maximum (or minimum) value of its branches.
es: El cálculo comienza de los nodos terminales hacia el nodo raíz. En cada nodo aleatorio, el valor esperado es calculado como la suma de las probabilidades en cada rama multiplicadas por el valor esperado en el nodo correspondiente. Para los nodos de decisión, el valor esperado es el valor máximo (o mínimo) de sus ramas.

source: Value returned by the function: * `"ev"`: expected value. * `"eu"`: expected utility. * `"ce"`: certainty equivalent.
es: Valor retornado por la función: * `"ev"`: valor esperado. * `"eu"`: utilidad esperada. * `"ce"`: equivalente a certeza.

source: Value returned by the function:
es: Valor retornado por la función:

source: `"ev"`: expected value.
es: `"ev"`: valor esperado.

source: `"eu"`: expected utility.
es: `"eu"`: utilidad esperada.

source: `"ce"`: certainty equivalent.
es: `"ce"`: equivalente a certeza.

source: Utility function used for the computations: * None: expected utility. * `"exp"`: exponential utility function. * `"log"`: logarithmic utility function.
es: Función de utilidad usada para los cálculos: * `None`: Utilidad esperada. * `"exp"`: Función de utilidad exponencial. * `"log"`: Función de utilidad logaritmica.

source: Utility function used for the computations:
es: Función de utilidad usada para los cálculos:

source: None: expected utility.
es: `None`: utilidad esperada.

source: `"exp"`: exponential utility function.
es: `"exp"`: función de utilidad exponencial.

source: Risk tolerance of the decision-maker.
es: Tolerancia al riesgo del decisor.
