Repository: jdvelasq/decision-analysis
Catalog: sphinx/locale/*/LC_MESSAGES/index.po
Languages: es

source: Smart-Choice: Decision-Making Analysis Toolkit
es: Smart-Choice: kit de herramientas de análisis para la toma de decisiones

source: **Author**
es: **Autor**

source: **What is it?**
es: **¿Qué es?**

source: **Smart-Choice** is a Python package for Decision-Making Analysis using decision trees. **Smart-Choice** allows the user to define a decision tree directly in Python. The best experience can be obtained when the package is used in a notebook inside of Jupyter Lab or Google Colab. **Smart-Choice** has no limits in the size of the decision tree created, and it can efficiently run large trees. Different reports are available to facilitate tree analysis.
es: **Smart-Choice** es un paquete de Python para el Análisis de Decisiones usando árboles de decision. **Smart-Choice** permite que el usuario defina un árbol de decisión completamente en Python. La mejor experiencia de uso se puede obtener cuando el paquete es usado en un libro de Jupyter Lab o Google Colab. **Smart-Choice** no tiene limites en el tamaño del árbol de decisión creado, y puede ejecutar eficientemente grandes árboles. Diferentes reportes están disponibles para facilitar el análisis.

source: **Main Features**
es: Principales características

source: The package allows the user to define the following types of nodes in a decision tree:
es: El paquete permite que el usuario defina los siguientes tipos de nodos en un árbol de decisión:

source: Chance nodes.
es: Nodos aleatorios.

source: Decision nodes.
es: Nodos de decisión.

source: End or Terminal nodes.
es: Nodos finales o terminales.

source: In the package, all model values and probabilities are entered directly as node properties using typical data structures in Python. Thus, an user with a basic knowledge of the programming language can use effectively the package.
es: En el paquete, todos los valores y probabilidades son entradas directametne como propiedades de los nodos usando estructuras de datos de Python. Así, un usuario con un conocimiento básico del lenguaje de programación puede usar efectivamente el paquete.

source: A run of the decision tree can be used using monetary expected values, but, the following utility functions can be used to represent risk adversion:
es: Una corrida del árbol de decisión puede ser conputada usando valores monetarios esperados, pero las siguientes funciones de utilidad pueden ser usadas para representar la aversión al riesgo:

source: Exponential.
es: Exponancial.

source: Logarithmic.
es: Logaritmica.

source: Different types of analysis can be conducted easily, including:
es: Diferentes tipos de análisis pueden ser ejecutados facilmente, incluyendo:

source: Decision analysis.
es: Análisis de decisiones.

source: Sensitivity analysis.
es: Análisis de sensibilidad.

source: Risk analysis.
es: Análisis de riesgo.

source: For the terminal of end nodes, the user must supply Python functions to evaluate the value of the node. This feature allows the user to use all capacity of Python programming language. It is possibe to write functions to run a complete Monte Carlo simulation using other packages as scipy. In other scenarios, it is possible to build complex predictive models that feed the decision model using, for example, scikit-learn. Other great adventage of the **Smart-Choice** is velocity where it is compared with spreadsheets; it is possible to run complex models in a fraction of the time required when a spreadsheet is used.
es: Para los terminales de los nodos finales, el usuario debe definir funciones de Python para evaluar el valor de dichos nodos. Esta característica permite que el usuario use toda la capacidad del lenguaje de programación. Es posible escriir funciones que ejecuten una simulación completa de Montecarlo usando paquetes como scipy. En otros escenarios, es posible construir modelos predictivos complejos que alimenten elmodelo de decisión usando, por ejemplo, scikit-learn. Otra gran ventaja de **Smart-Choice** es la velocidad cuando se le compara con hojas de calculo; es posible correr modelos complejos en una fracción del tiempo requerido cuando se usa una hoja decálculo.

source: **Release Information**
es: Información de la versión.

source: Date: July 21, 2021 **Version**: 0.1.0
es: Fecha: Julio 21, 2021 **Version**: 0.1.0

source: Binary Installers: `<https://pypi.org/project/smart-choice>`_
es: Instaladores binarios: `<https://pypi.org/project/smart-choice>`_

source: Source Repository: `<https://github.com/jdvelasq/smart-choice>`_
es: Repositorio del código fuente: `<https://github.com/jdvelasq/smart-choice>`_

source: Documentation: `<https://jdvelasq.github.io/smart-choice/>`_
es: Documentación: `<https://jdvelasq.github.io/smart-choice/>`_
