Repository: jdvelasq/decision-analysis
Catalog: sphinx/locale/*/LC_MESSAGES/risk_sensitivity.po
Languages: es

source: Risk Sensitivity Analysis
es: Análisis de Sensibilidad al Riesgo

source: Displays the sensitivity to risk attitude.
es: Muestra la sensibilidad de la actitud ante el riesgo.

source: Parameters
es: Parámetros

source: The decision tree to be analyzed.
es: El árbol de decisión a ser analizado.

source: Utility function to be used. * `"exp"`: exponential utility function. * `"log"`: logarithmic utility function.
es: Función de utilidad a ser usada: * `"exp"`: Función de utilidad exponencial. * `"log"`: Función de utilidad logaritmica.

source: Utility function to be used.
es: Función de utilidad a ser usada.

source: `"exp"`: exponential utility function.
es: `"exp"`: función de utilidad exponencial.

source: `"log"`: logarithmic utility function.
es: `"log"`: función de utilidad logaritmica.

source: Risk tolerance of the decision-maker.
es: Tolerancia al riesgo del decisor.

source: Identification number of the node to be analyzed.
es: Número de identificación del nodo a ser analizado.

source: Plots the sensibility to risk attitude.
es: Grafica la sensibilidad de la actitud ante el riesgo.
