Repository: jdvelasq/decision-analysis
Catalog: sphinx/locale/*/LC_MESSAGES/value_sensitivity.po
Languages: es

source: Value Sensitivity Analysis
es: Análisis de sensibilidad al valor

source: Displays sensitivity results to values in the decision tree.
es: Muestra los resultados de sensibilidad a los valores en el árbol de decisión.

source: Parameters
es: Parámetros

source: The decision tree to be analyzed.
es: El árbol de decisión a ser analizado.

source: Variable to be analyzed.
es: Variable a ser analizada.

source: Name of the branch.
es: Nombre de la rama

source: Tuple with the minimal and maximum values to be analyzed.
es: Tupla con los valores máximo y minimo a ser analizados.

source: When `True`, returns the expected value for chance nodes, and the optimal decision for event nodes. When `False` return the values for all branches of the node.
es: Cuando es `True`, retorna el valor esperado de los nodos aleatorios, y la decisión óptima para los nodos de decisión. Cuando es `False` retorna los valores para todas las ramas del nodo.

source: Identification number of the node to be analyzed.
es: Identificación del nodo a ser analizado.

source: Number of points used to create the plot.
es: Número de puntos a ser usados para crear la gráfica.

source: Return type
es: Tipo retornado

source: Plots the sensitivity to values
es: Grafica la sensibilidad a los valores.
